# Написать программу, которая на вход принимает число Н и выдает от -Н до Н
n = int(input('enter number N ='))
i = -n
print(i)
while i<n:
    i+=1
    print(i)
