# напишите программу, которая считывает длины катета и высоты 
# в прямоульном треугольнике и выдает его площадь
#каждое чсло записано в отдельной строке


# print('enter the length of the catheter 1 = ')
#a =  int(input())
# print('enter the length of the catheter 2 = ')
# b =  int(input())
# S = ((a*b)/2)
# print('the area of a right triangle =')
# print(S)

a =  int(input('enter the length of the catheter 1 = '))

b =  int(input('enter the length of the catheter 2 = '))

print(f'the area of a right triangle S = {a*b/2}')